### 📖 Terraform Plan (infra-pe/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.cgn_pe_apim.azurerm_subnet.cgn_pe_apim_subnet will be created
  + resource "azurerm_subnet" "cgn_pe_apim_subnet" {
      + address_prefixes                              = [
          + "10.26.5.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "io-p-cgn-pe-apim-snet-01"
      + private_endpoint_network_policies             = "Enabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "io-p-itn-cgn-pe-rg-01"
      + service_endpoints                             = [
          + "Microsoft.Web",
        ]
      + virtual_network_name                          = "io-p-itn-cgn-pe-vnet-01"

      + delegation {
          + name = "default"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/action",
                ]
              + name    = "Microsoft.Web/serverFarms"
            }
        }
    }

  # module.cgn_pe_fe.azurerm_cdn_frontdoor_route.this will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "this" {
      ~ cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.Cdn/profiles/io-p-itn-cgn-pe-frontend-afd-01/ruleSets/ruleset",
        ] -> (known after apply)
        id                              = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.Cdn/profiles/io-p-itn-cgn-pe-frontend-afd-01/afdEndpoints/io-p-itn-cgn-pe-frontend-assets-fde-01/routes/io-p-itn-cgn-pe-frontend-assets-cdnr-01"
        name                            = "io-p-itn-cgn-pe-frontend-assets-cdnr-01"
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.cgn_pe_fe.azurerm_cdn_frontdoor_rule.caching will be created
  + resource "azurerm_cdn_frontdoor_rule" "caching" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.Cdn/profiles/io-p-itn-cgn-pe-frontend-afd-01/ruleSets/ruleset"
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "Caching"
      + order                       = 5

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Cache-Control"
              + value         = "no-cache"
            }
          + route_configuration_override_action {
              + cache_behavior                = "HonorOrigin"
              + compression_enabled           = true
              + query_string_caching_behavior = "IgnoreQueryString"
            }
        }

      + conditions {
          + request_uri_condition {
              + negate_condition = false
              + operator         = "Any"
            }
        }
    }

  # module.cgn_pe_fe.azurerm_cdn_frontdoor_rule.enforce_https will be created
  + resource "azurerm_cdn_frontdoor_rule" "enforce_https" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.Cdn/profiles/io-p-itn-cgn-pe-frontend-afd-01/ruleSets/ruleset"
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "EnforceHTTPS"
      + order                       = 2

      + actions {
          + url_redirect_action {
              + redirect_protocol    = "Https"
              + redirect_type        = "Found"
                # (1 unchanged attribute hidden)
            }
        }

      + conditions {
          + request_scheme_condition {
              + match_values     = [
                  + "HTTP",
                ]
              + negate_condition = false
              + operator         = "Equal"
            }
        }
    }

  # module.cgn_pe_fe.azurerm_cdn_frontdoor_rule.enforce_https_assets will be created
  + resource "azurerm_cdn_frontdoor_rule" "enforce_https_assets" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "EnforceHTTPS"
      + order                       = 2

      + actions {
          + url_redirect_action {
              + redirect_protocol    = "Https"
              + redirect_type        = "Found"
                # (1 unchanged attribute hidden)
            }
        }

      + conditions {
          + request_scheme_condition {
              + match_values     = [
                  + "HTTP",
                ]
              + negate_condition = false
              + operator         = "Equal"
            }
        }
    }

  # module.cgn_pe_fe.azurerm_cdn_frontdoor_rule.global will be created
  + resource "azurerm_cdn_frontdoor_rule" "global" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.Cdn/profiles/io-p-itn-cgn-pe-frontend-afd-01/ruleSets/ruleset"
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "Global"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000"
            }
        }
    }

  # module.cgn_pe_fe.azurerm_cdn_frontdoor_rule.global_assets will be created
  + resource "azurerm_cdn_frontdoor_rule" "global_assets" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "Global"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000"
            }
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Content-Security-Policy-Report-Only"
              + value         = "default-src 'self'; frame-ancestors 'self'; script-src 'self'; style-src 'self'"
            }
          + route_configuration_override_action {
              + cache_behavior                = "OverrideAlways"
              + compression_enabled           = false
              + query_string_caching_behavior = "IgnoreQueryString"
            }
        }
    }

  # module.cgn_pe_fe.azurerm_cdn_frontdoor_rule.profile_images_cache will be created
  + resource "azurerm_cdn_frontdoor_rule" "profile_images_cache" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "ProfileImagesCache"
      + order                       = 3

      + actions {
          + route_configuration_override_action {
              + cache_behavior                = "OverrideAlways"
              + compression_enabled           = false
              + query_string_caching_behavior = "IgnoreQueryString"
            }
        }

      + conditions {
          + request_uri_condition {
              + match_values     = [
                  + "/profileimages",
                ]
              + negate_condition = false
              + operator         = "BeginsWith"
            }
        }
    }

  # module.cgn_pe_fe.azurerm_cdn_frontdoor_rule.rewrite_admin_rout will be created
  + resource "azurerm_cdn_frontdoor_rule" "rewrite_admin_rout" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.Cdn/profiles/io-p-itn-cgn-pe-frontend-afd-01/ruleSets/ruleset"
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "RewriteAdminRoute"
      + order                       = 4

      + actions {
          + url_rewrite_action {
              + destination             = "/index.html"
              + preserve_unmatched_path = false
              + source_pattern          = "/admin/"
            }
        }

      + conditions {
          + request_uri_condition {
              + match_values     = [
                  + "/admin/",
                ]
              + negate_condition = false
              + operator         = "Contains"
            }
        }
    }

  # module.cgn_pe_fe.azurerm_cdn_frontdoor_rule.rewrite_session_rout will be created
  + resource "azurerm_cdn_frontdoor_rule" "rewrite_session_rout" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.Cdn/profiles/io-p-itn-cgn-pe-frontend-afd-01/ruleSets/ruleset"
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "RewriteSessionRoute"
      + order                       = 3

      + actions {
          + url_rewrite_action {
              + destination             = "/index.html"
              + preserve_unmatched_path = false
              + source_pattern          = "/session"
            }
        }

      + conditions {
          + request_uri_condition {
              + match_values     = [
                  + "/session",
                ]
              + negate_condition = false
              + operator         = "Contains"
            }
        }
    }

  # module.cgn_pe_fe.azurerm_cdn_frontdoor_rule_set.assets_ruleset will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "assets_ruleset" {
      + cdn_frontdoor_profile_id = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.Cdn/profiles/io-p-itn-cgn-pe-frontend-afd-01"
      + id                       = (known after apply)
      + name                     = "assetsruleset"
    }

  # module.cgn_pe_apim.module.apim.azurerm_api_management.this will be created
  + resource "azurerm_api_management" "this" {
      + client_certificate_enabled    = false
      + developer_portal_url          = (known after apply)
      + gateway_disabled              = false
      + gateway_regional_url          = (known after apply)
      + gateway_url                   = (known after apply)
      + id                            = (known after apply)
      + location                      = "italynorth"
      + management_api_url            = (known after apply)
      + min_api_version               = "2021-08-01"
      + name                          = "io-p-itn-cgn-pe-apim-01"
      + notification_sender_email     = (known after apply)
      + portal_url                    = (known after apply)
      + private_ip_addresses          = (known after apply)
      + public_ip_addresses           = (known after apply)
      + public_network_access_enabled = false
      + publisher_email               = "io-operations@pagopa.it"
      + publisher_name                = "PagoPa CGN Onboarding Portal"
      + resource_group_name           = "io-p-itn-cgn-pe-rg-01"
      + scm_url                       = (known after apply)
      + sku_name                      = "StandardV2_1"
      + tags                          = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_api_management"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "2.0.0"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + virtual_network_type          = "Internal"

      + delegation (known after apply)

      + hostname_configuration (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + protocols (known after apply)

      + security (known after apply)

      + sign_in (known after apply)

      + sign_up {
          + enabled = false

          + terms_of_service {
              + consent_required = false
              + enabled          = false
            }
        }

      + tenant_access (known after apply)

      + virtual_network_configuration {
          + subnet_id = (known after apply)
        }
    }

  # module.cgn_pe_apim.module.apim.azurerm_network_security_group.nsg_apim will be created
  + resource "azurerm_network_security_group" "nsg_apim" {
      + id                  = (known after apply)
      + location            = "italynorth"
      + name                = "io-p-itn-cgn-pe-apim-nsg-01"
      + resource_group_name = "io-p-itn-cgn-pe-rg-01"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = "Access to Azure Key Vault for core service functionality"
              + destination_address_prefix                 = "AzureKeyVault"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "443"
              + destination_port_ranges                    = []
              + direction                                  = "Outbound"
              + name                                       = "azure-keyvault"
              + priority                                   = 202
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "VirtualNetwork"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = "Access to Azure SQL endpoints for core service functionality"
              + destination_address_prefix                 = "SQL"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "1433"
              + destination_port_ranges                    = []
              + direction                                  = "Outbound"
              + name                                       = "sql"
              + priority                                   = 201
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "VirtualNetwork"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = "Azure Infrastructure Load Balancer"
              + destination_address_prefix                 = "VirtualNetwork"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "6390"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "azure-load-balancer"
              + priority                                   = 201
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "AzureLoadBalancer"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = "Dependency on Azure Storage for core service functionality"
              + destination_address_prefix                 = "Storage"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "443"
              + destination_port_ranges                    = []
              + direction                                  = "Outbound"
              + name                                       = "storage"
              + priority                                   = 200
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "VirtualNetwork"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = "Management endpoint for Azure portal and PowerShell"
              + destination_address_prefix                 = "VirtualNetwork"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "3443"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "apim-management"
              + priority                                   = 200
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "ApiManagement"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = "Publish Diagnostics Logs and Metrics, Resource Health, and Application Insights"
              + destination_address_prefix                 = "AzureMonitor"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_ranges                    = [
                  + "1886",
                  + "443",
                ]
              + direction                                  = "Outbound"
              + name                                       = "azure-monitor"
              + priority                                   = 203
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "VirtualNetwork"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
        ]
      + tags                = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_api_management"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "2.0.0"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
    }

  # module.cgn_pe_apim.module.apim.azurerm_private_dns_a_record.apim_azure_api_net will be created
  + resource "azurerm_private_dns_a_record" "apim_azure_api_net" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "io-p-itn-cgn-pe-apim-01"
      + records             = (known after apply)
      + resource_group_name = "io-p-itn-cgn-pe-rg-01"
      + tags                = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_api_management"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "2.0.0"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + ttl                 = 3600
      + zone_name           = "azure-api.net"
    }

  # module.cgn_pe_apim.module.apim.azurerm_private_dns_a_record.apim_management_azure_api_net will be created
  + resource "azurerm_private_dns_a_record" "apim_management_azure_api_net" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "io-p-itn-cgn-pe-apim-01"
      + records             = (known after apply)
      + resource_group_name = "io-p-itn-cgn-pe-rg-01"
      + tags                = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_api_management"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "2.0.0"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + ttl                 = 3600
      + zone_name           = "management.azure-api.net"
    }

  # module.cgn_pe_apim.module.apim.azurerm_private_dns_a_record.apim_scm_azure_api_net will be created
  + resource "azurerm_private_dns_a_record" "apim_scm_azure_api_net" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "io-p-itn-cgn-pe-apim-01"
      + records             = (known after apply)
      + resource_group_name = "io-p-itn-cgn-pe-rg-01"
      + tags                = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_api_management"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "2.0.0"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + ttl                 = 3600
      + zone_name           = "scm.azure-api.net"
    }

  # module.cgn_pe_apim.module.apim.azurerm_subnet_network_security_group_association.snet_nsg will be created
  + resource "azurerm_subnet_network_security_group_association" "snet_nsg" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

Plan: 16 to add, 1 to change, 0 to destroy.
```

</details>
